# Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
# Пример: - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

# some_list = [2, 3, 5, 9, 3, 5, 6]
# sum = 0
# for i in range(len(some_list)):
#     if i%2 != 0:
#         sum += some_list[i]
# print(sum)
# _______________________________________________

# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример: - [2, 3, 4, 5, 6] => [12, 15, 16];
#         - [2, 3, 5, 6] => [12, 15]

# some_list = [2, 3, 4, 5, 6] # Пришлось сделать условие на проверку количества элементов в списке. Иначе последнее число задваивается или не пишется.
# if len(some_list) % 2 == 0:
#     result_list = [some_list[n] * some_list[-n - 1] for n in range(len(some_list)) if n - 1 < n / 2]
# else:
#     result_list = [some_list[n] * some_list[-n - 1] for n in range(len(some_list)) if n - 1 <= n / 2]
# print(result_list)
# ______________________________________________

# Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу между максимальным и минимальным значением дробной части элементов.
# Пример: - [1.1, 1.2, 3.1, 5, 10.01] => 0.19

# some_list = [1.1, 1.2, 3.1, 5, 10.01]
# max_, min_ = 0, 1
# for i in some_list:
#     if (divmod(i, 1))[1] > max_:
#         max_ = divmod(i, 1)[1]
#     elif (divmod(i, 1))[1] < min_ and (divmod(i, 1))[1] != 0:
#         min_ = (divmod(i, 1))[1]
# print(round(max_ - min_, 2))
# ______________________________________________

# Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Пример: - 45 -> 101101
#         - 3 -> 11
#         - 2 -> 10

# n = int(input('Введите число: '))
# number = ''
# print(str(bin(n))[2:])
# while n > 0:
#     number = number + str(n % 2)
#     n = n // 2
# print(number)
# ______________________________________________

# Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
# Пример: - для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21]

# number = int(input('Введите число: '))
# def fibonachi(num):
#     fibo = []
#     n1, n2 = 1, 1
#     for _ in range(num):
#         fibo.append(n1)
#         n1, n2 = n2, n1 + n2
#     n1, n2 = 0, 1
#     for _ in range(num+1):
#         fibo.insert(0, n1)
#         n1, n2 = n2, n1 - n2
#     return fibo
# print(fibonachi(number))
# ______________________________________________
